app/Controllers/Home.php

    public function index(): void
    {
        // Traer productos de la categoría Pesca (id=7), solo activos
        $destacadosPesca = $this->productoModel->where('categoria_id', 7)
            ->where('eliminado !=', 'SI')
            ->orderBy('id', 'DESC')
            ->limit(6)
            ->findAll();
        $data = [
            'destacadosPesca' => $destacadosPesca
        ];
        // Ofertas relámpago: productos de Camping (id=8)
        $ofertasCamping = $this->productoModel->where('categoria_id', 8)
            ->where('eliminado !=', 'SI')
            ->orderBy('id', 'DESC')
            ->limit(4)
            ->findAll();
---
SELECT *
FROM `productos`
WHERE `categoria_id` = 7
AND `eliminado` != 'SI'
ORDER BY `id` DESC
 LIMIT 6
SELECT *
FROM `productos`
WHERE `categoria_id` = 8
AND `eliminado` != 'SI'
ORDER BY `id` DESC
 LIMIT 4

    public function aDetalleProducto($id): void
    {
        $producto = $this->productoModel->where('id', $id)->first();
---
SELECT *
FROM `productos`
WHERE `id` = '2'
 LIMIT 1