app/Controllers/ProductoController.php

SELECT *
FROM `productos`
---
    public function index()
    {
        $productoModel = new Producto_model();
        // Solo productos no eliminados
        $productos = $productoModel->findAll(); // Trae todos, activos y eliminados