app/Controllers/Usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`, `perfil_id`) VALUES ('juan daniel', 'gomez miño', 'juandaniel', 'juan@gmail.com', '$2y$10$y3B2WYePbmolpbWzbFyOI.X5VZ2GQGJe/3LV4HjmeawrCFsvcPkm6', 2)
---
    public function formValidation()
    {

        $input = $this->validate(
            [
                'nombre' => 'required|min_length[3]',
                'apellido' => 'required|min_length[3]|max_length[25]',
                'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
                'usuario' => 'required|min_length[3]|is_unique[usuarios.usuario]',
                'pass' => 'required|min_length[3]|max_length[10]'
            ],
        );
        $formModel = new Usuarios_model();
        if (!$input) {
            $data['titulo'] = 'Registro';
            echo view('front/head_view', $data);
            echo view('back/usuario/registro', ['validation' => $this->validator]);
            echo view('front/footer_view');
            echo view('front/nav_view');        } else {

            $perfil_id = $this->request->getVar('perfil_id') ?? 1; // Por defecto: 1=Cliente según BD
            $formModel->save([
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'usuario' => $this->request->getVar('usuario'),
                'email' => $this->request->getVar('email'),
                'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
                'perfil_id' => $perfil_id
            ]);            session()->setFlashdata('success', 'Usuario registrado con exito');