app/Models/ProductoModel.php

    public function getProductoAll()
    {
        return $this->findAll();
---
SELECT *
FROM `productos`

    public function getRelacionados($categoria_id, $actual_id, $limit = 4)
    {
        return $this->where('categoria_id', $categoria_id)
            ->where('id !=', $actual_id)
            ->where('eliminado !=', 'SI')
            ->orderBy('RAND()')
            ->limit($limit)
            ->findAll();
---
SELECT *
FROM `productos`
WHERE `categoria_id` = '7'
AND `id` != '2'
AND `eliminado` != 'SI'
ORDER BY RAND()
 LIMIT 4